backend/controllers/AdminController.php

    public function actionIndex()
    {
        $isAdmin = User::findOne(['id' => Yii::$app->user->identity->id])->IsAdmin;
---
SELECT * FROM `user` WHERE `id`=1