backend/controllers/PostsController.php

    public function actionCreate()
    {
        $model = new posts();
        if ($model->load(Yii::$app->request->post())) {
            $model->UserID = Yii::$app->user->identity->id;
            if($model->save()){
---
INSERT INTO `Posts` (`Title`, `Description`, `CategoriesID`, `UserID`) VALUES ('last one', 'sdfspdfopsdfos', 1, 1)

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $posTagMod = new PostTags();
        if ($model->load(Yii::$app->request->post())) {
            if($model->save()){
---
UPDATE `Posts` SET `CategoriesID`=2 WHERE `ID`=44

    protected function addTags($tagsList,$id)
    {
        foreach ($tagsList as $value) {
            $newPostTags = new PostTags;
            $newPostTags->PostsID = $id;
            $newPostTags->TagsID = $value;
            $newPostTags->save();
---
INSERT INTO `PostTags` (`PostsID`, `TagsID`) VALUES (44, 1)