backend/views/layouts/main.php

SELECT * FROM `user` WHERE `id`=1
---

            $menuItems[] = ['label' => 'Add New Posts', 'url' => '/advanced/backend/web/index.php?r=posts/create'];

            $isAdmin = User::findOne(['id' => Yii::$app->user->identity->id])->IsAdmin;