backend/views/posts/_form.php

SELECT * FROM `Categories`
SELECT * FROM `Tags`
---

    <?= $form->field($model, 'Description')->textarea(['rows' => 6]) ?>

     <?= $form->field($model, 'CategoriesID')->dropDownList(
        ArrayHelper::map(Categories::find()->all(),'ID','Name'),
        ['prompt'=>'select Categories']
    ) ?>


    <?= $form->field($TagsModel, 'ID')->checkboxList(
        ArrayHelper::map(Tags::find()->all(),'ID','Name')
    ); ?>